{
   "title" : "De toekomst van aandelen" ,
  "subtitle" : "Datum: 17 januari 2021" ,
  "body" :"<p>Waarom zou je zelf aandelen kopen terwijl een computerbrein dat veel beter kan doen. Het computerbrein kan namelijk veel winst maken door slim in te kopen en te verkopen op de altijd veranderende beurs.</p> <p>Hoe gaat de aandelenhandel zich bewegen? Dit is een vraag die iedereen zou willen kunnen beantwoorden, maar helaas heeft deze vraag niet echt een antwoord. Dit komt namelijk door de chaos in het dagelijks leven zoals de dagelijkse crises, onthullingen van nieuwe producten, tegenvallende jaarcijfers en nog veel meer andere gebeurtenissen zorgen ervoor dat de markt continu schommelt. Een voorbeeld hiervan is de financiële crisis in 2008.</p> <p><img src=https://www.cashcow.nl/wp-content/uploads/2018/11/Aandelen-tech-e1542284144902.jpg></p> <p>Een groep duitse onderzoekers wilden weten of een kunstmatige intelligent programma zo’n zeer complexe wereld zou kunnen begrijpen. Ze bouwden een AI die via drie verschillende leermethodes tot voorspellingen kwam. De drie leermethodes die ze gebruikten waren deep learning, gradient boosting en random forests. Bij deep learning wordt input (de aandelenkoersen uit het verleden) door verschillende programmalagen heen gehaald. In elke laag sorteert de computer de input, totdat er aan het einde een resultaat komt: dit aandeel moet ik kopen en dit aandeel niet. De andere twee minder bekende fenomenen uit de machine learning. zorgen ervoor dat beslissings of voorspelling bomen, minder onzekerheid kennen. Alle drie de onderdelen van het computerbrein werden met maar liefst 180 miljoen datapunten getraind, tot het voorspel experts waren. Vervolgens werden de drie uitkomsten van de modellen samengenomen om op één voorspelling uit te komen. Door drie verschillende leermethoden te gebruiken hoopten de duitse onderzoekers de voorspellingen en transactie keuzes van hun AI stabieler te maken.</p> <p> <TABLE BORDER='10'> <TR> <TH> soorten machine learning </TH> <TH> deep learning </TH> <TH> gradient boosting </TH> <TH> random forests </TH> </TR> <TR> <TH> korte samenvatting </TH> <TD> <ol> <ul> <li> gebasseerd op artificial neural networks </li> <li> input wordt door verschillende programmalagen heen gehaald. </li> </ul> </ol> </TD> <TD> <ol> <ul> <li> techniek voor regressie- en classificatieproblemen </li> <li> produceert een voorspellingsmodel </li> </ul> </ol> </TD> <TD>  <ol> <ul> <li> ook random decision forests genoemd </li> <li> een verzamelingsmethode voor classificatie en regressie </li> </ul> </ol> </TD> </TR> </TABLE> </p> <p>Dit leek te werken de computer wist op sommige momenten wel 30 % winst per jaar te behalen. Maar het was niet allemaal rozegeur voor deze geavanceerde AI. Vanaf 2010 begonnen de winsten terug te lopen en maakte de computer zelfs verlies. Zoals de winsten in de jaren negentig hoog waren doordat de aandelenhandel simpel mensenwerk was, werden ze laag in de jaren tien. Dit komt omdat tegenwoordig de aandelenmarkt voor een flink deel is geautomatiseerd. Daardoor gaat handel sneller en kan zelfs een snel computerbrein het niet meer allemaal bijhouden.</p>",
  "background" : "/images/statistics.jpeg"
}