{
  "title" : "Google translate: machine learning in actie" ,
  "subtitle" : "Datum: 14 januari 2021" ,
  "body" : "In het begin was er niets, en dan was er IBM, die een demonstratie deed in 1954 dat de hele wereld deed sidderen. Maar was het perfect? Zeker niet. In die tijd was machine learning nog niet de snel groeiende industrie die het in het heden is. In die oertijden hebben men programma’s gemaakt waarin ze alle regels van een taal in coderen en alle woorden van een taal met hun betekenissen laten inzetten. Maar nu, nu hebben we iets wat ze toen nog niet de potentie daarvan wisten. Wij hebben nu machine learning. Mensen in de moderne tijd hebben geleerd dat ze niet per se een hele taal met al zijn regels en woorden in een programma moet zetten, maar kan de programma zelf laten leren hoe een taal allemaal in elkaar zit. Vandaag is Google Translate de meest gebruikte vertaler op aarde. Gebruikt door meer dan 500 miljoen mensen! Dus als we willen weten hoe het allemaal ongeveer in elkaar zit, zouden we naar Google Translate moeten kijken. Dus hoe werkt Google Translate? Om te beginnen bestaan er taal paren. Als iemand van het Engels naar het Nederlands wil vertalen, dan gebruikt Google Translate de taal paar: Engels-Nederlands. Bij het coderen van Google Translate, hebben de makers het MILJARDEN stukken tekst laten analyseren die beschikbaar zijn voor allebei de talen in een gegeven taal paar. Deze stukken tekst kunnen een hele boek of een gedichtje zijn, of alles ertussen in. Google Translate bekijkt al deze stukken tekst, terwijl het de eerste met de tweede vergelijkt. Zo zit de machine learning achter Google Translate er ongeveer uit. Tijdens die analyse van al dat tekst, is er een groep algoritmes achter de schermen die patronen probeert te herkennen. Na de miljarden teksten te hebben bekeken, komen er ook veel patronen voort die de vertaalprogramma allemaal zal gebruiken om teksten voor gebruikers te vertalen. Natuurlijk, er gebeurt veel meer dan dat, zoals hoe die algoritmes eenmaal patronen kunnen herkennen, maar dit is wat er in het essentieel allemaal gebeurt. Het feit dat machine learning zoveel data nodig heeft om preciezer tekst te kunnen vertalen, zou dat een probleem kunnen zijn voor sommige taal paren die nog lang niet zoveel beschikbare teksten hebben wat Google Translate kan analyseren. Gelukkig, in het heden, waar er overal blogs en vlogs opkomen in tientallen verschillende talen, is Google Translate veel beter geworden, omdat die ook veel meer data heeft die het kan analyseren."
}