{
  "title" : "Zelfrijdende auto's: Waar is het nu gebleven?",
  "subtitle" : "Datum: 14 januari 2021.",
  "body" : "<p>Zelfrijdende auto’s zijn de toekomst, met veel bedrijven die in de geschikte technologie investeren daarvoor: machine learning. De wereld is nog niet aangekomen bij volledig zelfrijdende auto’s. Maar, sommige autobedrijven produceren al auto’s die een zelfrijdende modus hebben. Het mag nog steeds niet worden gebruikt zonder dat een persoon met een rijbewijs achter het stuur de auto onder de gaten houdt, omdat men nog tijd nodig hebben om de zelfrijdende functie te verbeteren. Machine learning werkt met data en analyseert die data vooral uit zichzelf, maar het kost veel tijd om genoeg data in handen te krijgen en om door al die data heen te werken.</p> <p>Een bedrijf dat heel erg ver is met het maken van zelfrijdende auto’s is Tesla. Alle vier models die het bedrijf produceert: Model S, Model 3, Model X en Model Y komen met een zelfrijdende modus.</p> <p>Hier is een korte video te zien die aangeeft wat de voor-kijkende camera van het zelfrijdende modus van Tesla allemaal voor dingen herkent:</p> <p><iframe width='560' height='315' src='https://www.youtube.com/embed/fKXztwtXaGo' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe> </p> <p>Zoals je ziet, zijn het er heel veel. <ol><ul><li>Auto’s en mensen</li> <li>Stoppalen</li> <li>De stoep</li> <li>Natte wegen</li> <li>Pijlen op de weg en waar ze naartoe wijzen.</li></ul></ol></p> <p> Dit allemaal hebben de ingenieurs in Tesla allemaal ontwikkeld met behulp van machine learning. Ze hebben het programma zoveel data laten analyseren dat het programma al deze dingen kan herkennen. Is dat niet geweldig?! Verder, dit gebeurt allemaal live. Het programma heeft al dit te kunnen weten terwijl de auto aan het rijden is. Met zo weinig tijd, kan een programma met machine learning al die dingen leren herkennen.</p> <p><img class='image'src='https://electrek.co/wp-content/uploads/sites/3/2020/10/Tesla-Autopilot-sensors.jpg?'> </p> <p> Die video van daarvoor. Die heeft alleen laten zien wat een Tesla door zijn voor-camera ziet. Maar een Tesla heeft ook camera’s aan zijn zij en achterkant! Maar, zoals al eerder gezegd is het systeem nog niet perfect. Er gebeuren nog veel ongelukken. Tesla heeft wel gezegd dat hun zelfrijdende modus wel 9x veiliger is dan de gemiddelde autorijder. Experts hebben deze claim niet kunnen steunen omdat Tesla’s zelfrijdende modus vaak alleen wordt gebruikt in snelwegen, waar er veel minder ongelukken gebeuren doordat het verkeer daar heel soepel en simpel is.Dat over het heden. Maar de toekomst. Wanneer zullen we volledig zelfrijdende auto’s kunnen zien? Amerikaanse minister van Vervoer heeft in 2016 voorspeld dat de technologie in 2021 zal komen. Maar of dat zal gebeuren, ligt aan hoe de veld van machine learning zich gaat ontwikkelen.</p>",
  "background" : "/images/mountain-road.jpeg"
}